src/Plugins/Nop.Plugin.Shipping.UPS/Connected Services/UPSTrack/Track.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- UPS Tracking Service WSDL Release Date Jul 12, 2008 -->
<!-- Copyright 2007-2008 United Parcel Service of America, Inc. All rights reserved.   -->
<wsdl:definitions name="Track" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:error="http://www.ups.com/XMLSchema/XOLTWS/Error/v1.1" xmlns:upss="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0" xmlns:trk="http://www.ups.com/XMLSchema/XOLTWS/Track/v2.0" xmlns:tns="http://www.ups.com/WSDL/XOLTWS/Track/v2.0" targetNamespace="http://www.ups.com/WSDL/XOLTWS/Track/v2.0">
	<wsdl:types>
		<xsd:schema>
			<!-- This schema defines the UPS Security header used for authorization purposes -->
			<xsd:import namespace="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0" schemaLocation="UPSSecurity.xsd"/>
			<!--  This schema defines the error detail data types returned within SOAPFaults to provide more specific information pertaining to the problem. -->
			<xsd:import namespace="http://www.ups.com/XMLSchema/XOLTWS/Error/v1.1" schemaLocation="Error1.1.xsd"/>
			<!-- This schema defines the Tracking service data types -->
			<xsd:import namespace="http://www.ups.com/XMLSchema/XOLTWS/Track/v2.0" schemaLocation="TrackWebServiceSchema.xsd"/>
		</xsd:schema>
	</wsdl:types>
	<wsdl:message name="TrackRequestMessage">
		<wsdl:part name="Body" element="trk:TrackRequest"/>
		<wsdl:part name="UPSSecurity" element="upss:UPSSecurity"/>
	</wsdl:message>
	<wsdl:message name="TrackResponseMessage">
		<wsdl:part name="Body" element="trk:TrackResponse"/>
	</wsdl:message>
	<wsdl:message name="TrackErrorMessage">
		<wsdl:part name="TrackError" element="error:Errors"/>
	</wsdl:message>
	<wsdl:portType name="TrackPortType">
		<wsdl:operation name="ProcessTrack">
			<wsdl:input name="TrackRequest" message="tns:TrackRequestMessage"/>
			<wsdl:output name="TrackResponse" message="tns:TrackResponseMessage"/>
			<wsdl:fault name="TrackError" message="tns:TrackErrorMessage"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="TrackBinding" type="tns:TrackPortType">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="ProcessTrack">
			<soap:operation soapAction="http://onlinetools.ups.com/webservices/TrackBinding/v2.0" style="document"/>
			<wsdl:input name="TrackRequest">
				<soap:body parts="Body" use="literal"/>
				<soap:header message="tns:TrackRequestMessage" part="UPSSecurity" use="literal">
					<soap:headerfault message="tns:TrackErrorMessage" part="TrackError" use="literal"/>
				</soap:header>
			</wsdl:input>
			<wsdl:output name="TrackResponse">
				<soap:body parts="Body" use="literal"/>
			</wsdl:output>
			<wsdl:fault name="TrackError">
				<soap:fault name="TrackError" use="literal"/>
			</wsdl:fault>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="TrackService">
		<wsdl:port name="TrackPort" binding="tns:TrackBinding">
			<!-- CIE (Customer Integration Environment) URL -->
			<soap:address location="https://wwwcie.ups.com/webservices/Track"/>
		</wsdl:port>
        <wsdl:port name="ProductionTrackPort" binding="tns:TrackBinding">
            <!-- Production URL -->
          <soap:address location="https://onlinetools.ups.com/webservices/Track"/>
        </wsdl:port>
	</wsdl:service>
</wsdl:definitions>
